In [1]:
people = {
    "first": ["Prashant", "Dilip", "Vivek"],
    "last": ["Singh", "Singh", "Kumar"],
    "email": ["pk.airsqn@gmail.com", "dilip.singh@gmail.com", "vivek.krypton@outlook.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

      first   last                      email
0  Prashant  Singh        pk.airsqn@gmail.com
1     Dilip  Singh      dilip.singh@gmail.com
2     Vivek  Kumar  vivek.krypton@outlook.com

In [5]:
df['email']

0          pk.airsqn@gmail.com
1        dilip.singh@gmail.com
2    vivek.krypton@outlook.com
Name: email, dtype: object

In [6]:
df.set_index('email')

                              first   last
email
pk.airsqn@gmail.com        Prashant  Singh
dilip.singh@gmail.com         Dilip  Singh
vivek.krypton@outlook.com     Vivek  Kumar

In [7]:
df

      first   last                      email
0  Prashant  Singh        pk.airsqn@gmail.com
1     Dilip  Singh      dilip.singh@gmail.com
2     Vivek  Kumar  vivek.krypton@outlook.com

In [12]:
df.set_index('email', inplace=True)
df

                              first   last
email
pk.airsqn@gmail.com        Prashant  Singh
dilip.singh@gmail.com         Dilip  Singh
vivek.krypton@outlook.com     Vivek  Kumar

In [10]:
df.iloc[1]

first    Dilip
last     Singh
Name: dilip.singh@gmail.com, dtype: object

In [13]:
df.reset_index(inplace=True)
df

                       email     first   last
0        pk.airsqn@gmail.com  Prashant  Singh
1      dilip.singh@gmail.com     Dilip  Singh
2  vivek.krypton@outlook.com     Vivek  Kumar